thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned char P1DIR;  /* Port 1 Direction */

  struct
  {
    unsigned char P1DIR_0        : 1;
    unsigned char P1DIR_1        : 1;
    unsigned char P1DIR_2        : 1;
    unsigned char P1DIR_3        : 1;
    unsigned char P1DIR_4        : 1;
    unsigned char P1DIR_5        : 1;
    unsigned char P1DIR_6        : 1;
    unsigned char P1DIR_7        : 1;
  } P1DIR_bit;
} @ 0x0022;


enum {
  P1DIR_0             = 0x0001,
  P1DIR_1             = 0x0002,
  P1DIR_2             = 0x0004,
  P1DIR_3             = 0x0008,
  P1DIR_4             = 0x0010,
  P1DIR_5             = 0x0020,
  P1DIR_6             = 0x0040,
  P1DIR_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P1IFG;  /* Port 1 Interrupt Flag  */

  struct
  {
    unsigned char P1IFG_0        : 1;
    unsigned char P1IFG_1        : 1;
    unsigned char P1IFG_2        : 1;
    unsigned char P1IFG_3        : 1;
    unsigned char P1IFG_4        : 1;
    unsigned char P1IFG_5        : 1;
    unsigned char P1IFG_6        : 1;
    unsigned char P1IFG_7        : 1;
  } P1IFG_bit;
} @ 0x0023;


enum {
  P1IFG_0             = 0x0001,
  P1IFG_1             = 0x0002,
  P1IFG_2             = 0x0004,
  P1IFG_3             = 0x0008,
  P1IFG_4             = 0x0010,
  P1IFG_5             = 0x0020,
  P1IFG_6             = 0x0040,
  P1IFG_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P1IES;  /* Port 1 Interrupt Edge Select */

  struct
  {
    unsigned char P1IES_0        : 1;
    unsigned char P1IES_1        : 1;
    unsigned char P1IES_2        : 1;
    unsigned char P1IES_3        : 1;
    unsigned char P1IES_4        : 1;
    unsigned char P1IES_5        : 1;
    unsigned char P1IES_6        : 1;
    unsigned char P1IES_7        : 1;
  } P1IES_bit;
} @ 0x0024;


enum {
  P1IES_0             = 0x0001,
  P1IES_1             = 0x0002,
  P1IES_2             = 0x0004,
  P1IES_3             = 0x0008,
  P1IES_4             = 0x0010,
  P1IES_5             = 0x0020,
  P1IES_6             = 0x0040,
  P1IES_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P1IE;  /* Port 1 Interrupt Enable */

  struct
  {
    unsigned char P1IE_0         : 1;
    unsigned char P1IE_1         : 1;
    unsigned char P1IE_2         : 1;
    unsigned char P1IE_3         : 1;
    unsigned char P1IE_4         : 1;
    unsigned char P1IE_5         : 1;
    unsigned char P1IE_6         : 1;
    unsigned char P1IE_7         : 1;
  } P1IE_bit;
} @ 0x0025;


enum {
  P1IE_0              = 0x0001,
  P1IE_1              = 0x0002,
  P1IE_2              = 0x0004,
  P1IE_3              = 0x0008,
  P1IE_4              = 0x0010,
  P1IE_5              = 0x0020,
  P1IE_6              = 0x0040,
  P1IE_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P1SEL;  /* Port 1 Selection */

  struct
  {
    unsigned char P1SEL_0        : 1;
    unsigned char P1SEL_1        : 1;
    unsigned char P1SEL_2        : 1;
    unsigned char P1SEL_3        : 1;
    unsigned char P1SEL_4        : 1;
    unsigned char P1SEL_5        : 1;
    unsigned char P1SEL_6        : 1;
    unsigned char P1SEL_7        : 1;
  } P1SEL_bit;
} @ 0x0026;


enum {
  P1SEL_0             = 0x0001,
  P1SEL_1             = 0x0002,
  P1SEL_2             = 0x0004,
  P1SEL_3             = 0x0008,
  P1SEL_4             = 0x0010,
  P1SEL_5             = 0x0020,
  P1SEL_6             = 0x0040,
  P1SEL_7             = 0x0080,
};


__no_init volatile union
{
  unsigned __READ char P2IN;  /* Port 2 Input */

  struct
  {
    unsigned __READ char P2IN_0  : 1;
    unsigned __READ char P2IN_1  : 1;
    unsigned __READ char P2IN_2  : 1;
    unsigned __READ char P2IN_3  : 1;
    unsigned __READ char P2IN_4  : 1;
    unsigned __READ char P2IN_5  : 1;
    unsigned __READ char P2IN_6  : 1;
    unsigned __READ char P2IN_7  : 1;
  } P2IN_bit;
} @ 0x0028;


enum {
  P2IN_0              = 0x0001,
  P2IN_1              = 0x0002,
  P2IN_2              = 0x0004,
  P2IN_3              = 0x0008,
  P2IN_4              = 0x0010,
  P2IN_5              = 0x0020,
  P2IN_6              = 0x0040,
  P2IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P2OUT;  /* Port 2 Output */

  struct
  {
    unsigned char P2OUT_0        : 1;
    unsigned char P2OUT_1        : 1;
    unsigned char P2OUT_2        : 1;
    unsigned char P2OUT_3        : 1;
    unsigned char P2OUT_4        : 1;
    unsigned char P2OUT_5        : 1;
    unsigned char P2OUT_6        : 1;
    unsigned char P2OUT_7        : 1;
  } P2OUT_bit;
} @ 0x0029;


enum {
  P2OUT_0             = 0x0001,
  P2OUT_1             = 0x0002,
  P2OUT_2             = 0x0004,
  P2OUT_3             = 0x0008,
  P2OUT_4             = 0x0010,
  P2OUT_5             = 0x0020,
  P2OUT_6             = 0x0040,
  P2OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P2DIR;  /* Port 2 Direction */

  struct
  {
    unsigned char P2DIR_0        : 1;
    unsigned char P2DIR_1        : 1;
    unsigned char P2DIR_2        : 1;
    unsigned char P2DIR_3        : 1;
    unsigned char P2DIR_4        : 1;
    unsigned char P2DIR_5        : 1;
    unsigned char P2DIR_6        : 1;
    unsigned char P2DIR_7        : 1;
  } P2DIR_bit;
} @ 0x002A;


enum {
  P2DIR_0             = 0x0001,
  P2DIR_1             = 0x0002,
  P2DIR_2             = 0x0004,
  P2DIR_3             = 0x0008,
  P2DIR_4             = 0x0010,
  P2DIR_5             = 0x0020,
  P2DIR_6             = 0x0040,
  P2DIR_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P2IFG;  /* Port 2 Interrupt Flag */

  struct
  {
    unsigned char P2IFG_0        : 1;
    unsigned char P2IFG_1        : 1;
    unsigned char P2IFG_2        : 1;
    unsigned char P2IFG_3        : 1;
    unsigned char P2IFG_4        : 1;
    unsigned char P2IFG_5        : 1;
    unsigned char P2IFG_6        : 1;
    unsigned char P2IFG_7        : 1;
  } P2IFG_bit;
} @ 0x002B;


enum {
  P2IFG_0             = 0x0001,
  P2IFG_1             = 0x0002,
  P2IFG_2             = 0x0004,
  P2IFG_3             = 0x0008,
  P2IFG_4             = 0x0010,
  P2IFG_5             = 0x0020,
  P2IFG_6             = 0x0040,
  P2IFG_7             = 0x0080,
};


