thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned char P4OUT;  /* Port 4 Output */

  struct
  {
    unsigned char P4OUT_0        : 1;
    unsigned char P4OUT_1        : 1;
    unsigned char P4OUT_2        : 1;
    unsigned char P4OUT_3        : 1;
    unsigned char P4OUT_4        : 1;
    unsigned char P4OUT_5        : 1;
    unsigned char P4OUT_6        : 1;
    unsigned char P4OUT_7        : 1;
  } P4OUT_bit;
} @ 0x001D;


enum {
  P4OUT_0             = 0x0001,
  P4OUT_1             = 0x0002,
  P4OUT_2             = 0x0004,
  P4OUT_3             = 0x0008,
  P4OUT_4             = 0x0010,
  P4OUT_5             = 0x0020,
  P4OUT_6             = 0x0040,
  P4OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P4DIR;  /* Port 4 Direction */

  struct
  {
    unsigned char P4DIR_0        : 1;
    unsigned char P4DIR_1        : 1;
    unsigned char P4DIR_2        : 1;
    unsigned char P4DIR_3        : 1;
    unsigned char P4DIR_4        : 1;
    unsigned char P4DIR_5        : 1;
    unsigned char P4DIR_6        : 1;
    unsigned char P4DIR_7        : 1;
  } P4DIR_bit;
} @ 0x001E;


enum {
  P4DIR_0             = 0x0001,
  P4DIR_1             = 0x0002,
  P4DIR_2             = 0x0004,
  P4DIR_3             = 0x0008,
  P4DIR_4             = 0x0010,
  P4DIR_5             = 0x0020,
  P4DIR_6             = 0x0040,
  P4DIR_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P4SEL;  /* Port 4 Selection */

  struct
  {
    unsigned char P4SEL_0        : 1;
    unsigned char P4SEL_1        : 1;
    unsigned char P4SEL_2        : 1;
    unsigned char P4SEL_3        : 1;
    unsigned char P4SEL_4        : 1;
    unsigned char P4SEL_5        : 1;
    unsigned char P4SEL_6        : 1;
    unsigned char P4SEL_7        : 1;
  } P4SEL_bit;
} @ 0x001F;


enum {
  P4SEL_0             = 0x0001,
  P4SEL_1             = 0x0002,
  P4SEL_2             = 0x0004,
  P4SEL_3             = 0x0008,
  P4SEL_4             = 0x0010,
  P4SEL_5             = 0x0020,
  P4SEL_6             = 0x0040,
  P4SEL_7             = 0x0080,
};



/*-------------------------------------------------------------------------
 *   Digital I/O Port5/6
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ char P5IN;  /* Port 5 Input */

  struct
  {
    unsigned __READ char P5IN_0  : 1;
    unsigned __READ char P5IN_1  : 1;
    unsigned __READ char P5IN_2  : 1;
    unsigned __READ char P5IN_3  : 1;
    unsigned __READ char P5IN_4  : 1;
    unsigned __READ char P5IN_5  : 1;
    unsigned __READ char P5IN_6  : 1;
    unsigned __READ char P5IN_7  : 1;
  } P5IN_bit;
} @ 0x0030;


enum {
  P5IN_0              = 0x0001,
  P5IN_1              = 0x0002,
  P5IN_2              = 0x0004,
  P5IN_3              = 0x0008,
  P5IN_4              = 0x0010,
  P5IN_5              = 0x0020,
  P5IN_6              = 0x0040,
  P5IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P5OUT;  /* Port 5 Output */

  struct
  {
    unsigned char P5OUT_0        : 1;
    unsigned char P5OUT_1        : 1;
    unsigned char P5OUT_2        : 1;
    unsigned char P5OUT_3        : 1;
    unsigned char P5OUT_4        : 1;
    unsigned char P5OUT_5        : 1;
    unsigned char P5OUT_6        : 1;
    unsigned char P5OUT_7        : 1;
  } P5OUT_bit;
} @ 0x0031;


enum {
  P5OUT_0             = 0x0001,
  P5OUT_1             = 0x0002,
  P5OUT_2             = 0x0004,
  P5OUT_3             = 0x0008,
  P5OUT_4             = 0x0010,
  P5OUT_5             = 0x0020,
  P5OUT_6             = 0x0040,
  P5OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P5DIR;  /* Port 5 Direction */

  struct
  {
    unsigned char P5DIR_0        : 1;
    unsigned char P5DIR_1        : 1;
    unsigned char P5DIR_2        : 1;
    unsigned char P5DIR_3        : 1;
    unsigned char P5DIR_4        : 1;
    unsigned char P5DIR_5        : 1;
    unsigned char P5DIR_6        : 1;
    unsigned char P5DIR_7        : 1;
  } P5DIR_bit;
} @ 0x0032;


enum {
  P5DIR_0             = 0x0001,
  P5DIR_1             = 0x0002,
  P5DIR_2             = 0x0004,
  P5DIR_3             = 0x0008,
  P5DIR_4             = 0x0010,
  P5DIR_5             = 0x0020,
  P5DIR_6             = 0x0040,
  P5DIR_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P5SEL;  /* Port 5 Selection */

  struct
  {
    unsigned char P5SEL_0        : 1;
    unsigned char P5SEL_1        : 1;
    unsigned char P5SEL_2        : 1;
    unsigned char P5SEL_3        : 1;
    unsigned char P5SEL_4        : 1;
    unsigned char P5SEL_5        : 1;
    unsigned char P5SEL_6        : 1;
    unsigned char P5SEL_7        : 1;
  } P5SEL_bit;
} @ 0x0033;


enum {
  P5SEL_0             = 0x0001,
  P5SEL_1             = 0x0002,
  P5SEL_2             = 0x0004,
  P5SEL_3             = 0x0008,
  P5SEL_4             = 0x0010,
  P5SEL_5             = 0x0020,
  P5SEL_6             = 0x0040,
  P5SEL_7             = 0x0080,
};


__no_init volatile union
{
  unsigned __READ char P6IN;  /* Port 6 Input */

  struct
  {
    unsigned __READ char P6IN_0  : 1;
    unsigned __READ char P6IN_1  : 1;
    unsigned __READ char P6IN_2  : 1;
    unsigned __READ char P6IN_3  : 1;
    unsigned __READ char P6IN_4  : 1;
    unsigned __READ char P6IN_5  : 1;
    unsigned __READ char P6IN_6  : 1;
    unsigned __READ char P6IN_7  : 1;
  } P6IN_bit;
} @ 0x0034;


enum {
  P6IN_0              = 0x0001,
  P6IN_1              = 0x0002,
  P6IN_2              = 0x0004,
  P6IN_3              = 0x0008,
  P6IN_4              = 0x0010,
  P6IN_5              = 0x0020,
  P6IN_6              = 0x0040,
  P6IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P6OUT;  /* Port 6 Output */

  struct
  {
    unsigned char P6OUT_0        : 1;
    unsigned char P6OUT_1        : 1;
    unsigned char P6OUT_2        : 1;
    unsigned char P6OUT_3        : 1;
    unsigned char P6OUT_4        : 1;
    unsigned char P6OUT_5        : 1;
    unsigned char P6OUT_6        : 1;
    unsigned char P6OUT_7        : 1;
  } P6OUT_bit;
} @ 0x0035;


enum {
  P6OUT_0             = 0x0001,
  P6OUT_1             = 0x0002,
  P6OUT_2             = 0x0004,
  P6OUT_3             = 0x0008,
  P6OUT_4             = 0x0010,
  P6OUT_5             = 0x0020,
  P6OUT_6             = 0x0040,
  P6OUT_7             = 0x0080,
};


