thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
#define I2CPSC U0MCTL  /* I2C Pre-scaler */

 /* USART 0 Baud Rate 0 */
__no_init volatile unsigned char U0BR0 @ 0x0074;

#define I2CSCLH U0BR0  /* I2C SCL High */

 /* USART 0 Baud Rate 1 */
__no_init volatile unsigned char U0BR1 @ 0x0075;

#define I2CSCLL U0BR1  /* I2C SCL Low */

__no_init union
{
  struct
  {
    volatile __READ unsigned char     U0RXBUF;
    volatile unsigned char            U0TXBUF;

  };
  volatile unsigned short             I2CDRW;
  volatile unsigned char              I2CDRB;
} @ 0x0076;


#define __MSP430_HAS_UART0__          /* Definition to show that Module is available */

/* Alternate register names */
#define UCTL0               U0CTL     /* USART 0 Control */
#define UTCTL0              U0TCTL    /* USART 0 Transmit Control */
#define URCTL0              U0RCTL    /* USART 0 Receive Control */
#define UMCTL0              U0MCTL    /* USART 0 Modulation Control */
#define UBR00               U0BR0     /* USART 0 Baud Rate 0 */
#define UBR10               U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF0              U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF0              U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL0_              U0CTL     /* USART 0 Control */
#define UTCTL0_             U0TCTL    /* USART 0 Transmit Control */
#define URCTL0_             U0RCTL    /* USART 0 Receive Control */
#define UMCTL0_             U0MCTL    /* USART 0 Modulation Control */
#define UBR00_              U0BR0     /* USART 0 Baud Rate 0 */
#define UBR10_              U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF0_             U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF0_             U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL_0              U0CTL     /* USART 0 Control */
#define UTCTL_0             U0TCTL    /* USART 0 Transmit Control */
#define URCTL_0             U0RCTL    /* USART 0 Receive Control */
#define UMCTL_0             U0MCTL    /* USART 0 Modulation Control */
#define UBR0_0              U0BR0     /* USART 0 Baud Rate 0 */
#define UBR1_0              U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF_0             U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF_0             U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL_0_             U0CTL     /* USART 0 Control */
#define UTCTL_0_            U0TCTL    /* USART 0 Transmit Control */
#define URCTL_0_            U0RCTL    /* USART 0 Receive Control */
#define UMCTL_0_            U0MCTL    /* USART 0 Modulation Control */
#define UBR0_0_             U0BR0     /* USART 0 Baud Rate 0 */
#define UBR1_0_             U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF_0_            U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF_0_            U0TXBUF   /* USART 0 Transmit Buffer */


/*-------------------------------------------------------------------------
 *   I2C
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char I2CIE;  /* I2C Interrupt Enable */

  struct
  {
    unsigned char ALIE           : 1;  /* Arbitration lost */
    unsigned char NACKIE         : 1;  /* No acknowledge */
    unsigned char OAIE           : 1;  /* Own address */
    unsigned char ARDYIE         : 1;  /* Access ready (opeation complete) */
    unsigned char RXRDYIE        : 1;  /* Receive ready (data received) */
    unsigned char TXRDYIE        : 1;  /* Transmit ready (transmit register empty) */
    unsigned char GCIE           : 1;  /* General call */
    unsigned char STTIE          : 1;  /* Start condition */
  } I2CIE_bit;
} @ 0x0050;


enum {
  ALIE                = 0x0001,
  NACKIE              = 0x0002,
  OAIE                = 0x0004,
  ARDYIE              = 0x0008,
  RXRDYIE             = 0x0010,
  TXRDYIE             = 0x0020,
  GCIE                = 0x0040,
  STTIE               = 0x0080,
};


__no_init volatile union
{
  unsigned char I2CIFG;  /* I2C Interrupt Flag */

  struct
  {
    unsigned char ALIFG          : 1;  /* Arbitration lost */
    unsigned char NACKIFG        : 1;  /* No acknowledge */
    unsigned char OAIFG          : 1;  /* Own address */
    unsigned char ARDYIFG        : 1;  /* Access ready (opeation complete) */
    unsigned char RXRDYIFG       : 1;  /* Receive ready (data received) */
    unsigned char TXRDYIFG       : 1;  /* Transmit ready (transmit register empty) */
    unsigned char GCIFG          : 1;  /* General call */
    unsigned char STTIFG         : 1;  /* Start condition */
  } I2CIFG_bit;
} @ 0x0051;


enum {
  ALIFG               = 0x0001,
  NACKIFG             = 0x0002,
  OAIFG               = 0x0004,
  ARDYIFG             = 0x0008,
  RXRDYIFG            = 0x0010,
  TXRDYIFG            = 0x0020,
  GCIFG               = 0x0040,
  STTIFG              = 0x0080,
};


 /* I2C Data Count */
__no_init volatile unsigned char I2CNDAT @ 0x0052;


 /* I2C Own Address */
__no_init volatile unsigned short I2COA @ 0x0118;


 /* I2C Slave Address */
__no_init volatile unsigned short I2CSA @ 0x011A;


 /* I2C Interrupt Vector */
__no_init volatile unsigned __READ short I2CIV @ 0x011C;


#define __MSP430_HAS_I2C__           /* Definition to show that Module is available */

#define I2CTCTL_          U0TCTL     /* I2C Transfer Control */

#define I2CSSEL_0        (0*0x10u)   /* I2C clock select 0: UCLK */
#define I2CSSEL_1        (1*0x10u)   /* I2C clock select 1: ACLK */
#define I2CSSEL_2        (2*0x10u)   /* I2C clock select 2: SMCLK */
#define I2CSSEL_3        (3*0x10u)   /* I2C clock select 3: SMCLK */

#define I2CMM_0          (0x00)      	 /* Master mode 0 */
#define I2CMM_1          (I2CSTT)    	 /* Master mode 1 */
#define I2CMM_2          (I2CSTP+I2CSTT) /* Master mode 2 */
#define I2CMM_3          (I2CRM+I2CSTT)  /* Master mode 3 */
#define I2CMM_4          (I2CSTP)    	 /* Master mode 4 */

#define I2CDCTL_          USART0     /* I2C Data Control */

#define I2CPSC            U0MCTL     /* I2C Pre-scaler */
#define I2CPSC_           U0MCTL     /* I2C Pre-scaler */
#define I2CSCLH           U0BR0      /* I2C SCL High */
#define I2CSCLH_          U0BR0      /* I2C SCL High */
#define I2CSCLL           U0BR1      /* I2C SCL Low */
#define I2CSCLL_          U0BR1      /* I2C SCL Low */

#define I2CDRB_           I2CDRB     /* I2C Data for Byte access */
#define I2CDRW_           I2CDRW     /* I2C Data for Word access */

#define I2CIV_NONE       (0x0000)    /* I2C interrupt vector: No interrupt pending */
#define I2CIV_AL         (0x0002)    /* I2C interrupt vector: Arbitration lost (ALIFG) */
#define I2CIV_NACK       (0x0004)    /* I2C interrupt vector: No acknowledge (NACKIFG) */
#define I2CIV_OA         (0x0006)    /* I2C interrupt vector: Own address (OAIFG) */
#define I2CIV_ARDY       (0x0008)    /* I2C interrupt vector: Access ready (ARDYIFG) */
#define I2CIV_RXRDY      (0x000A)    /* I2C interrupt vector: Receive ready (RXRDYIFG) */
#define I2CIV_TXRDY      (0x000C)    /* I2C interrupt vector: Transmit ready (TXRDYIFG) */
#define I2CIV_GC         (0x000E)    /* I2C interrupt vector: General call (GCIFG) */
#define I2CIV_STT        (0x0010)    /* I2C interrupt vector: Start condition (STTIFG) */


/*-------------------------------------------------------------------------
 *   USART 1
 *-------------------------------------------------------------------------*/


