thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned char U1CTL;  /* USART 1 Control */

  struct
  {
    unsigned char SWRST          : 1;  /* USART Software Reset */
    unsigned char MM             : 1;  /* Master Mode off/on */
    unsigned char SYNC           : 1;  /* UART / SPI mode */
    unsigned char LISTEN         : 1;  /* Listen mode */
    unsigned char CHAR2          : 1;  /* Data 0:7-bits / 1:8-bits */
    unsigned char SPB            : 1;  /* Stop Bits 0:one / 1: two */
    unsigned char PEV            : 1;  /* Parity 0:odd / 1:even */
    unsigned char PENA           : 1;  /* Parity enable */
  } U1CTL_bit;
} @ 0x0078;




__no_init volatile union
{
  unsigned char U1TCTL;  /* USART 1 Transmit Control */

  struct
  {
    unsigned char TXEPT          : 1;  /* TX Buffer empty */
    unsigned char STC            : 1;  /* SPI: STC enable 0:on / 1:off */
    unsigned char TXWAKE         : 1;  /* TX Wake up mode */
    unsigned char URXSE          : 1;  /* Receive Start edge select */
    unsigned char SSEL0          : 1;  /* Clock Source Select 0 */
    unsigned char SSEL1          : 1;  /* Clock Source Select 1 */
    unsigned char CKPL           : 1;  /* Clock Polarity */
    unsigned char CKPH           : 1;  /* SPI: Clock Phase */
  } U1TCTL_bit;
} @ 0x0079;




__no_init volatile union
{
  unsigned char U1RCTL;  /* USART 1 Receive Control */

  struct
  {
    unsigned char RXERR          : 1;  /* RX Error Error */
    unsigned char RXWAKE         : 1;  /* RX Wake up detect */
    unsigned char URXWIE         : 1;  /* RX Wake up interrupt enable */
    unsigned char URXEIE         : 1;  /* RX Error interrupt enable */
    unsigned char BRK            : 1;  /* Break detected */
    unsigned char OE             : 1;  /* Overrun Error */
    unsigned char PE             : 1;  /* Parity Error */
    unsigned char FE             : 1;  /* Frame Error */
  } U1RCTL_bit;
} @ 0x007A;




 /* USART 1 Modulation Control */
__no_init volatile unsigned char U1MCTL @ 0x007B;


 /* USART 1 Baud Rate 0 */
__no_init volatile unsigned char U1BR0 @ 0x007C;


 /* USART 1 Baud Rate 1 */
__no_init volatile unsigned char U1BR1 @ 0x007D;


 /* USART 1 Receive Buffer */
__no_init volatile unsigned __READ char U1RXBUF @ 0x007E;


 /* USART 1 Transmit Buffer */
__no_init volatile unsigned char U1TXBUF @ 0x007F;


#define __MSP430_HAS_UART1__          /* Definition to show that Module is available */

/* Alternate register names */

#define UCTL1               U1CTL     /* USART 1 Control */
#define UTCTL1              U1TCTL    /* USART 1 Transmit Control */
#define URCTL1              U1RCTL    /* USART 1 Receive Control */
#define UMCTL1              U1MCTL    /* USART 1 Modulation Control */
#define UBR01               U1BR0     /* USART 1 Baud Rate 0 */
#define UBR11               U1BR1     /* USART 1 Baud Rate 1 */
#define RXBUF1              U1RXBUF   /* USART 1 Receive Buffer */
#define TXBUF1              U1TXBUF   /* USART 1 Transmit Buffer */
#define UCTL1_              U1CTL     /* USART 1 Control */
#define UTCTL1_             U1TCTL    /* USART 1 Transmit Control */
#define URCTL1_             U1RCTL    /* USART 1 Receive Control */
#define UMCTL1_             U1MCTL    /* USART 1 Modulation Control */
#define UBR01_              U1BR0     /* USART 1 Baud Rate 0 */
#define UBR11_              U1BR1     /* USART 1 Baud Rate 1 */
#define RXBUF1_             U1RXBUF   /* USART 1 Receive Buffer */
#define TXBUF1_             U1TXBUF   /* USART 1 Transmit Buffer */
#define UCTL_1              U1CTL     /* USART 1 Control */
#define UTCTL_1             U1TCTL    /* USART 1 Transmit Control */
#define URCTL_1             U1RCTL    /* USART 1 Receive Control */
#define UMCTL_1             U1MCTL    /* USART 1 Modulation Control */
#define UBR0_1              U1BR0     /* USART 1 Baud Rate 0 */
#define UBR1_1              U1BR1     /* USART 1 Baud Rate 1 */
#define RXBUF_1             U1RXBUF   /* USART 1 Receive Buffer */
#define TXBUF_1             U1TXBUF   /* USART 1 Transmit Buffer */
#define UCTL_1_             U1CTL     /* USART 1 Control */
#define UTCTL_1_            U1TCTL    /* USART 1 Transmit Control */
#define URCTL_1_            U1RCTL    /* USART 1 Receive Control */
#define UMCTL_1_            U1MCTL    /* USART 1 Modulation Control */
#define UBR0_1_             U1BR0     /* USART 1 Baud Rate 0 */
#define UBR1_1_             U1BR1     /* USART 1 Baud Rate 1 */
#define RXBUF_1_            U1RXBUF   /* USART 1 Receive Buffer */
#define TXBUF_1_            U1TXBUF   /* USART 1 Transmit Buffer */


/*-------------------------------------------------------------------------
 *   Timer A3
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ short TAIV;  /* Timer A Interrupt Vector Word */

  struct
  {
    unsigned __READ short        : 1;
    unsigned __READ short IRQVEC : 3;
    unsigned __READ short        : 12;
  } TAIV_bit;
} @ 0x012E;


enum {
  IRQVEC              = 0x0008,
};


__no_init volatile union
{
  unsigned short TACTL;  /* Timer A Control */

  struct
  {
    unsigned short TAIFG         : 1;  /* Timer A counter interrupt flag */
    unsigned short TAIE          : 1;  /* Timer A counter interrupt enable */
    unsigned short TACLR         : 1;  /* Timer A counter clear */
    unsigned short               : 1;
    unsigned short TAMC          : 2;  /* Timer A mode control 0 */
    unsigned short TAID          : 2;  /* Timer A clock input divider */
    unsigned short TASSEL        : 2;  /* Timer A clock source select */
    unsigned short               : 6;
  } TACTL_bit;
} @ 0x0160;


enum {
  TAIFG               = 0x0001,
  TAIE                = 0x0002,
  TACLR               = 0x0004,
  TAMC                = 0x0020,
  TAID                = 0x0080,
  TASSEL              = 0x0200,
};


