thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned short TBCCTL5;  /* Timer B Capture/Compare Control 5 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL5_bit;
} @ 0x018C;




__no_init volatile union
{
  unsigned short TBCCTL6;  /* Timer B Capture/Compare Control 6 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL6_bit;
} @ 0x018E;




 /* Timer B */
__no_init volatile unsigned short TBR @ 0x0190;


 /* Timer B Capture/Compare 0 */
__no_init volatile unsigned short TBCCR0 @ 0x0192;


 /* Timer B Capture/Compare 1 */
__no_init volatile unsigned short TBCCR1 @ 0x0194;


 /* Timer B Capture/Compare 2 */
__no_init volatile unsigned short TBCCR2 @ 0x0196;


 /* Timer B Capture/Compare 3 */
__no_init volatile unsigned short TBCCR3 @ 0x0198;


 /* Timer B Capture/Compare 4 */
__no_init volatile unsigned short TBCCR4 @ 0x019A;


 /* Timer B Capture/Compare 5 */
__no_init volatile unsigned short TBCCR5 @ 0x019C;


 /* Timer B Capture/Compare 6 */
__no_init volatile unsigned short TBCCR6 @ 0x019E;


#define __MSP430_HAS_TB7__            /* Definition to show that Module is available */

#define TBSSEL_0      (0*0x0100u)  /* Clock Source: TBCLK */
#define TBSSEL_1      (1*0x0100u)  /* Clock Source: ACLK  */
#define TBSSEL_2      (2*0x0100u)  /* Clock Source: SMCLK */
#define TBSSEL_3      (3*0x0100u)  /* Clock Source: INCLK */
#define CNTL_0        (0*0x0800u)  /* Counter lenght: 16 bit */
#define CNTL_1        (1*0x0800u)  /* Counter lenght: 12 bit */
#define CNTL_2        (2*0x0800u)  /* Counter lenght: 10 bit */
#define CNTL_3        (3*0x0800u)  /* Counter lenght:  8 bit */
#define SHR_0         (0*0x2000u)  /* Timer B Group: 0 - individually */
#define SHR_1         (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2         (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3         (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */
#define TBCLGRP_0     (0*0x2000u)  /* Timer B Group: 0 - individually */
#define TBCLGRP_1     (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TBCLGRP_2     (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define TBCLGRP_3     (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */

#define CLLD1         (0x0400)     /* Compare latch load source 1 */
#define CLLD0         (0x0200)     /* Compare latch load source 0 */

#define SLSHR1        (0x0400)     /* Compare latch load source 1 */
#define SLSHR0        (0x0200)     /* Compare latch load source 0 */

#define SLSHR_0       (0*0x0200u)  /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1       (1*0x0200u)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2       (2*0x0200u)  /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3       (3*0x0200u)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0        (0*0x0200u)  /* Compare latch load sourec : 0 - immediate */
#define CLLD_1        (1*0x0200u)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2        (2*0x0200u)  /* Compare latch load sourec : 2 - up/down */
#define CLLD_3        (3*0x0200u)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */


/*-------------------------------------------------------------------------
 *   Basic Clock Module
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char DCOCTL;  /* DCO Clock Frequency Control */

  struct
  {
    unsigned char MOD0           : 1;  /* Modulation Bit 0 */
    unsigned char MOD1           : 1;  /* Modulation Bit 1 */
    unsigned char MOD2           : 1;  /* Modulation Bit 2 */
    unsigned char MOD3           : 1;  /* Modulation Bit 3 */
    unsigned char MOD4           : 1;  /* Modulation Bit 4 */
    unsigned char DCO0           : 1;  /* DCO Select Bit 0 */
    unsigned char DCO1           : 1;  /* DCO Select Bit 1 */
    unsigned char DCO2           : 1;  /* DCO Select Bit 2 */
  } DCOCTL_bit;
} @ 0x0056;


enum {
  MOD0                = 0x0001,
  MOD1                = 0x0002,
  MOD2                = 0x0004,
  MOD3                = 0x0008,
  MOD4                = 0x0010,
  DCO0                = 0x0020,
  DCO1                = 0x0040,
  DCO2                = 0x0080,
};


__no_init volatile union
{
  unsigned char BCSCTL1;  /* Basic Clock System Control 1 */

  struct
  {
    unsigned char RSEL0          : 1;  /* Range Select Bit 0 */
    unsigned char RSEL1          : 1;  /* Range Select Bit 1 */
    unsigned char RSEL2          : 1;  /* Range Select Bit 2 */
    unsigned char XT5V           : 1;  /* XT5V should always be reset */
    unsigned char DIVA0          : 1;  /* ACLK Divider 0 */
    unsigned char DIVA1          : 1;  /* ACLK Divider 1 */
    unsigned char XTS            : 1;  /* LFXTCLK 0:Low Freq. / 1: High Freq. */
    unsigned char XT2OFF         : 1;  /* Enable XT2CLK */
  } BCSCTL1_bit;
} @ 0x0057;


enum {
  RSEL0               = 0x0001,
  RSEL1               = 0x0002,
  RSEL2               = 0x0004,
  XT5V                = 0x0008,
  DIVA0               = 0x0010,
  DIVA1               = 0x0020,
  XTS                 = 0x0040,
  XT2OFF              = 0x0080,
};


