thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned char BCSCTL2;  /* Basic Clock System Control 2 */

  struct
  {
    unsigned char DCOR           : 1;  /* Enable External Resistor : 1 */
    unsigned char DIVS0          : 1;  /* SMCLK Divider 0 */
    unsigned char DIVS1          : 1;  /* SMCLK Divider 1 */
    unsigned char SELS           : 1;  /* SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK */
    unsigned char DIVM0          : 1;  /* CLK Divider 0 */
    unsigned char DIVM1          : 1;  /* CLK Divider 1 */
    unsigned char SELM0          : 1;  /* MCLK Source Select 0 */
    unsigned char SELM1          : 1;  /* MCLK Source Select 1 */
  } BCSCTL2_bit;
} @ 0x0058;


enum {
  DCOR                = 0x0001,
  DIVS0               = 0x0002,
  DIVS1               = 0x0004,
  SELS                = 0x0008,
  DIVM0               = 0x0010,
  DIVM1               = 0x0020,
  SELM0               = 0x0040,
  SELM1               = 0x0080,
};


#define __MSP430_HAS_BASIC_CLOCK__ 	/* Definition to show that Module is available */

#define DIVA_0           (0x00)   	/* ACLK Divider 0: /1 */
#define DIVA_1           (0x10)   	/* ACLK Divider 1: /2 */
#define DIVA_2           (0x20)   	/* ACLK Divider 2: /4 */
#define DIVA_3           (0x30)   	/* ACLK Divider 3: /8 */

#define DIVS_0           (0x00)   	/* SMCLK Divider 0: /1 */
#define DIVS_1           (0x02)   	/* SMCLK Divider 1: /2 */
#define DIVS_2           (0x04)   	/* SMCLK Divider 2: /4 */
#define DIVS_3           (0x06)   	/* SMCLK Divider 3: /8 */

#define DIVM_0           (0x00)   	/* MCLK Divider 0: /1 */
#define DIVM_1           (0x10)   	/* MCLK Divider 1: /2 */
#define DIVM_2           (0x20)   	/* MCLK Divider 2: /4 */
#define DIVM_3           (0x30)   	/* MCLK Divider 3: /8 */

#define SELM_0           (0x00)   	/* MCLK Source Select 0: DCOCLK */
#define SELM_1           (0x40)   	/* MCLK Source Select 1: DCOCLK */
#define SELM_2           (0x80)   	/* MCLK Source Select 2: XT2CLK/LFXTCLK */
#define SELM_3           (0xC0)   	/* MCLK Source Select 3: LFXTCLK */


/*-------------------------------------------------------------------------
 *   Comparator A
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char CACTL1;  /* Comparator A Control 1 */

  struct
  {
    unsigned char CAIFG          : 1;  /* Comp. A Interrupt Flag */
    unsigned char CAIE           : 1;  /* Comp. A Interrupt Enable */
    unsigned char CAIES          : 1;  /* Comp. A Int. Edge Select: 0:rising / 1:falling */
    unsigned char CAON           : 1;  /* Comp. A enable */
    unsigned char CAREF0         : 1;  /* Comp. A Internal Reference Select 0 */
    unsigned char CAREF1         : 1;  /* Comp. A Internal Reference Select 1 */
    unsigned char CARSEL         : 1;  /* Comp. A Internal Reference Enable */
    unsigned char CAEX           : 1;  /* Comp. A Exchange Inputs */
  } CACTL1_bit;
} @ 0x0059;


enum {
  CAIFG               = 0x0001,
  CAIE                = 0x0002,
  CAIES               = 0x0004,
  CAON                = 0x0008,
  CAREF0              = 0x0010,
  CAREF1              = 0x0020,
  CARSEL              = 0x0040,
  CAEX                = 0x0080,
};


__no_init volatile union
{
  unsigned char CACTL2;  /* Comparator A Control 2 */

  struct
  {
    unsigned char CAOUT          : 1;  /* Comp. A Output */
    unsigned char CAF            : 1;  /* Comp. A Enable Output Filter */
    unsigned char P2CA0          : 1;  /* Comp. A Connect External Signal to CA0 : 1 */
    unsigned char P2CA1          : 1;  /* Comp. A Connect External Signal to CA1 : 1 */
    unsigned char CACTL24        : 1;
    unsigned char CACTL25        : 1;
    unsigned char CACTL26        : 1;
    unsigned char CACTL27        : 1;
  } CACTL2_bit;
} @ 0x005A;


enum {
  CAOUT               = 0x0001,
  CAF                 = 0x0002,
  P2CA0               = 0x0004,
  P2CA1               = 0x0008,
  CACTL24             = 0x0010,
  CACTL25             = 0x0020,
  CACTL26             = 0x0040,
  CACTL27             = 0x0080,
};


__no_init volatile union
{
  unsigned char CAPD;  /* Comparator A Port Disable */

  struct
  {
    unsigned char CAPD0          : 1;  /* Comp. A Disable Input Buffer of Port Register .0 */
    unsigned char CAPD1          : 1;  /* Comp. A Disable Input Buffer of Port Register .1 */
    unsigned char CAPD2          : 1;  /* Comp. A Disable Input Buffer of Port Register .2 */
    unsigned char CAPD3          : 1;  /* Comp. A Disable Input Buffer of Port Register .3 */
    unsigned char CAPD4          : 1;  /* Comp. A Disable Input Buffer of Port Register .4 */
    unsigned char CAPD5          : 1;  /* Comp. A Disable Input Buffer of Port Register .5 */
    unsigned char CAPD6          : 1;  /* Comp. A Disable Input Buffer of Port Register .6 */
    unsigned char CAPD7          : 1;  /* Comp. A Disable Input Buffer of Port Register .7 */
  } CAPD_bit;
} @ 0x005B;


enum {
  CAPD0               = 0x0001,
  CAPD1               = 0x0002,
  CAPD2               = 0x0004,
  CAPD3               = 0x0008,
  CAPD4               = 0x0010,
  CAPD5               = 0x0020,
  CAPD6               = 0x0040,
  CAPD7               = 0x0080,
};


#define __MSP430_HAS_COMPA__       /* Definition to show that Module is available */

#define CAREF_0          (0x00)    /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1          (0x10)    /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2          (0x20)    /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3          (0x30)    /* Comp. A Int. Ref. Select 3 : Vt*/


/*-------------------------------------------------------------------------
 *   ADC12
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short ADC12CTL0;  /* ADC12 Control 0 */

  struct
  {
    unsigned short ADC12SC       : 1;  /* ADC12 Start Conversion */
    unsigned short ENC           : 1;  /* ADC12 Enable Conversion */
    unsigned short ADC12TOVIE    : 1;  /* ADC12 Timer Overflow interrupt enable */
    unsigned short ADC12OVIE     : 1;  /* ADC12 Overflow interrupt enable */
    unsigned short ADC12ON       : 1;  /* ADC12 On/enable */
    unsigned short REFON         : 1;  /* ADC12 Reference on */
    unsigned short REF2_5V       : 1;  /* ADC12 Ref 0:1.5V / 1:2.5V */
    unsigned short MSC           : 1;  /* ADC12 Multiple SampleConversion */
    unsigned short SHT0          : 4;  /* ADC12 Sample Hold 0 */
    unsigned short SHT1          : 4;  /* ADC12 Sample Hold 1 */
  } ADC12CTL0_bit;
} @ 0x01A0;


enum {
  ADC12SC             = 0x0001,
  ENC                 = 0x0002,
  ADC12TOVIE          = 0x0004,
  ADC12OVIE           = 0x0008,
  ADC12ON             = 0x0010,
  REFON               = 0x0020,
  REF2_5V             = 0x0040,
  MSC                 = 0x0080,
  SHT0                = 0x0800,
  SHT1                = 0x8000,
};


