thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned short ADC12CTL1;  /* ADC12 Control 1 */

  struct
  {
    unsigned short ADC12BUSY     : 1;  /* ADC12 Busy */
    unsigned short CONSEQ        : 2;  /* ADC12 Conversion Sequence Select */
    unsigned short ADC12SSEL     : 2;  /* ADC12 Clock Source Select */
    unsigned short ADC12DIV      : 3;  /* ADC12 Clock Divider Select */
    unsigned short ISSH          : 1;  /* ADC12 Invert Sample Hold Signal */
    unsigned short SHP           : 1;  /* ADC12 Sample/Hold Pulse Mode */
    unsigned short SHS           : 2;  /* ADC12 Sample/Hold Source */
    unsigned short CSTARTADD     : 4;  /* ADC12 Conversion Start Address */
  } ADC12CTL1_bit;
} @ 0x01A2;


enum {
  ADC12BUSY           = 0x0001,
  CONSEQ              = 0x0004,
  ADC12SSEL           = 0x0010,
  ADC12DIV            = 0x0080,
  ISSH                = 0x0100,
  SHP                 = 0x0200,
  SHS                 = 0x0800,
  CSTARTADD           = 0x8000,
};


 /* ADC12 Interrupt Flag */
__no_init volatile unsigned short ADC12IFG @ 0x01A4;


 /* ADC12 Interrupt Enable */
__no_init volatile unsigned short ADC12IE @ 0x01A6;


 /* ADC12 Interrupt Vector Word */
__no_init volatile unsigned short ADC12IV @ 0x01A8;


 /* ADC12 Conversion Memory 0 */
__no_init volatile unsigned short ADC12MEM0 @ 0x0140;


 /* ADC12 Conversion Memory 1 */
__no_init volatile unsigned short ADC12MEM1 @ 0x0142;


 /* ADC12 Conversion Memory 2 */
__no_init volatile unsigned short ADC12MEM2 @ 0x0144;


 /* ADC12 Conversion Memory 3 */
__no_init volatile unsigned short ADC12MEM3 @ 0x0146;


 /* ADC12 Conversion Memory 4 */
__no_init volatile unsigned short ADC12MEM4 @ 0x0148;


 /* ADC12 Conversion Memory 5 */
__no_init volatile unsigned short ADC12MEM5 @ 0x014A;


 /* ADC12 Conversion Memory 6 */
__no_init volatile unsigned short ADC12MEM6 @ 0x014C;


 /* ADC12 Conversion Memory 7 */
__no_init volatile unsigned short ADC12MEM7 @ 0x014E;


 /* ADC12 Conversion Memory 8 */
__no_init volatile unsigned short ADC12MEM8 @ 0x0150;


 /* ADC12 Conversion Memory 9 */
__no_init volatile unsigned short ADC12MEM9 @ 0x0152;


 /* ADC12 Conversion Memory 10 */
__no_init volatile unsigned short ADC12MEM10 @ 0x0154;


 /* ADC12 Conversion Memory 11 */
__no_init volatile unsigned short ADC12MEM11 @ 0x0156;


 /* ADC12 Conversion Memory 12 */
__no_init volatile unsigned short ADC12MEM12 @ 0x0158;


 /* ADC12 Conversion Memory 13 */
__no_init volatile unsigned short ADC12MEM13 @ 0x015A;


 /* ADC12 Conversion Memory 14 */
__no_init volatile unsigned short ADC12MEM14 @ 0x015C;


 /* ADC12 Conversion Memory 15 */
__no_init volatile unsigned short ADC12MEM15 @ 0x015E;


__no_init volatile union
{
  unsigned char ADC12MCTL0;  /* ADC12 Memory Control 0 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL0_bit;
} @ 0x0080;


enum {
  INCH                = 0x0008,
  SREF                = 0x0040,
  EOS                 = 0x0080,
};


__no_init volatile union
{
  unsigned char ADC12MCTL1;  /* ADC12 Memory Control 1 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL1_bit;
} @ 0x0081;




__no_init volatile union
{
  unsigned char ADC12MCTL2;  /* ADC12 Memory Control 2 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL2_bit;
} @ 0x0082;




__no_init volatile union
{
  unsigned char ADC12MCTL3;  /* ADC12 Memory Control 3 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL3_bit;
} @ 0x0083;




__no_init volatile union
{
  unsigned char ADC12MCTL4;  /* ADC12 Memory Control 4 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL4_bit;
} @ 0x0084;




__no_init volatile union
{
  unsigned char ADC12MCTL5;  /* ADC12 Memory Control 5 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL5_bit;
} @ 0x0085;




__no_init volatile union
{
  unsigned char ADC12MCTL6;  /* ADC12 Memory Control 6 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL6_bit;
} @ 0x0086;




__no_init volatile union
{
  unsigned char ADC12MCTL7;  /* ADC12 Memory Control 7 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL7_bit;
} @ 0x0087;




__no_init volatile union
{
  unsigned char ADC12MCTL8;  /* ADC12 Memory Control 8 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL8_bit;
} @ 0x0088;




__no_init volatile union
{
  unsigned char ADC12MCTL9;  /* ADC12 Memory Control 9 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL9_bit;
} @ 0x0089;




__no_init volatile union
{
  unsigned char ADC12MCTL10;  /* ADC12 Memory Control 10 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL10_bit;
} @ 0x008A;




__no_init volatile union
{
  unsigned char ADC12MCTL11;  /* ADC12 Memory Control 11 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL11_bit;
} @ 0x008B;




