thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
__no_init volatile union
{
  unsigned char ADC12MCTL12;  /* ADC12 Memory Control 12 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL12_bit;
} @ 0x008C;




__no_init volatile union
{
  unsigned char ADC12MCTL13;  /* ADC12 Memory Control 13 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL13_bit;
} @ 0x008D;




__no_init volatile union
{
  unsigned char ADC12MCTL14;  /* ADC12 Memory Control 14 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL14_bit;
} @ 0x008E;




__no_init volatile union
{
  unsigned char ADC12MCTL15;  /* ADC12 Memory Control 15 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL15_bit;
} @ 0x008F;




#define __MSP430_HAS_ADC12__          /* Definition to show that Module is available */

#define SHT0_0        	 (0*0x100u)
#define SHT0_1        	 (1*0x100u)
#define SHT0_2        	 (2*0x100u)
#define SHT0_3        	 (3*0x100u)
#define SHT0_4        	 (4*0x100u)
#define SHT0_5        	 (5*0x100u)
#define SHT0_6        	 (6*0x100u)
#define SHT0_7        	 (7*0x100u)
#define SHT0_8        	 (8*0x100u)
#define SHT0_9        	 (9*0x100u)
#define SHT0_10       	(10*0x100u)
#define SHT0_11       	(11*0x100u)
#define SHT0_12       	(12*0x100u)
#define SHT0_13       	(13*0x100u)
#define SHT0_14       	(14*0x100u)
#define SHT0_15       	(15*0x100u)

#define SHT1_0        	 (0*0x1000u)
#define SHT1_1        	 (1*0x1000u)
#define SHT1_2        	 (2*0x1000u)
#define SHT1_3        	 (3*0x1000u)
#define SHT1_4        	 (4*0x1000u)
#define SHT1_5        	 (5*0x1000u)
#define SHT1_6        	 (6*0x1000u)
#define SHT1_7        	 (7*0x1000u)
#define SHT1_8        	 (8*0x1000u)
#define SHT1_9        	 (9*0x1000u)
#define SHT1_10       	(10*0x1000u)
#define SHT1_11       	(11*0x1000u)
#define SHT1_12       	(12*0x1000u)
#define SHT1_13       	(13*0x1000u)
#define SHT1_14       	(14*0x1000u)
#define SHT1_15       	(15*0x1000u)

#define CONSEQ_0             (0*2u)
#define CONSEQ_1             (1*2u)
#define CONSEQ_2             (2*2u)
#define CONSEQ_3             (3*2u)
#define ADC12SSEL_0          (0*8u)
#define ADC12SSEL_1          (1*8u)
#define ADC12SSEL_2          (2*8u)
#define ADC12SSEL_3          (3*8u)
#define ADC12DIV_0           (0*0x20u)
#define ADC12DIV_1           (1*0x20u)
#define ADC12DIV_2           (2*0x20u)
#define ADC12DIV_3           (3*0x20u)
#define ADC12DIV_4           (4*0x20u)
#define ADC12DIV_5           (5*0x20u)
#define ADC12DIV_6           (6*0x20u)
#define ADC12DIV_7           (7*0x20u)
#define SHS_0                (0*0x400u)
#define SHS_1                (1*0x400u)
#define SHS_2                (2*0x400u)
#define SHS_3                (3*0x400u)
#define CSTARTADD_0          (0*0x1000u)
#define CSTARTADD_1          (1*0x1000u)
#define CSTARTADD_2          (2*0x1000u)
#define CSTARTADD_3          (3*0x1000u)
#define CSTARTADD_4          (4*0x1000u)
#define CSTARTADD_5          (5*0x1000u)
#define CSTARTADD_6          (6*0x1000u)
#define CSTARTADD_7          (7*0x1000u)
#define CSTARTADD_8          (8*0x1000u)
#define CSTARTADD_9          (9*0x1000u)
#define CSTARTADD_10        (10*0x1000u)
#define CSTARTADD_11        (11*0x1000u)
#define CSTARTADD_12        (12*0x1000u)
#define CSTARTADD_13        (13*0x1000u)
#define CSTARTADD_14        (14*0x1000u)
#define CSTARTADD_15        (15*0x1000u)

#define INCH_0               (0)
#define INCH_1               (1)
#define INCH_2               (2)
#define INCH_3               (3)
#define INCH_4               (4)
#define INCH_5               (5)
#define INCH_6               (6)
#define INCH_7               (7)
#define INCH_8               (8)
#define INCH_9               (9)
#define INCH_10             (10)
#define INCH_11             (11)
#define INCH_12             (12)
#define INCH_13             (13)
#define INCH_14             (14)
#define INCH_15             (15)

#define SREF_0               (0*0x10u)
#define SREF_1               (1*0x10u)
#define SREF_2               (2*0x10u)
#define SREF_3               (3*0x10u)
#define SREF_4               (4*0x10u)
#define SREF_5               (5*0x10u)
#define SREF_6               (6*0x10u)
#define SREF_7               (7*0x10u)


/*-------------------------------------------------------------------------
 *   DAC12
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short DAC12_0CTL;  /* DAC12_0 Control */

  struct
  {
    unsigned short DAC12GRP      : 1;  /* DAC12 group */
    unsigned short DAC12ENC      : 1;  /* DAC12 enable conversion */
    unsigned short DAC12IFG      : 1;  /* DAC12 interrupt flag */
    unsigned short DAC12IE       : 1;  /* DAC12 interrupt enable */
    unsigned short DAC12DF       : 1;  /* DAC12 data format */
    unsigned short DAC12AMP0     : 1;  /* DAC12 amplifier bit 0 */
    unsigned short DAC12AMP1     : 1;  /* DAC12 amplifier bit 1 */
    unsigned short DAC12AMP2     : 1;  /* DAC12 amplifier bit 2 */
    unsigned short DAC12IR       : 1;  /* DAC12 input reference and output range */
    unsigned short DAC12CALON    : 1;  /* DAC12 calibration */
    unsigned short DAC12LSEL0    : 1;  /* DAC12 load select bit 0 */
    unsigned short DAC12LSEL1    : 1;  /* DAC12 load select bit 1 */
    unsigned short DAC12RES      : 1;  /* DAC12 resolution */
    unsigned short DAC12SREF0    : 1;  /* DAC12 reference bit 0 */
    unsigned short DAC12SREF1    : 1;  /* DAC12 reference bit 1 */
  } DAC12_0CTL_bit;
} @ 0x01C0;


enum {
  DAC12GRP            = 0x0001,
  DAC12ENC            = 0x0002,
  DAC12IFG            = 0x0004,
  DAC12IE             = 0x0008,
  DAC12DF             = 0x0010,
  DAC12AMP0           = 0x0020,
  DAC12AMP1           = 0x0040,
  DAC12AMP2           = 0x0080,
  DAC12IR             = 0x0100,
  DAC12CALON          = 0x0200,
  DAC12LSEL0          = 0x0400,
  DAC12LSEL1          = 0x0800,
  DAC12RES            = 0x1000,
  DAC12SREF0          = 0x2000,
  DAC12SREF1          = 0x4000,
};


