thanhbinh89/flappy-bird/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16x.h
#define DMADT_0         (0*0x1000u)  /* DMA transfer mode 0: single */
#define DMADT_1         (1*0x1000u)  /* DMA transfer mode 1: block */
#define DMADT_2         (2*0x1000u)  /* DMA transfer mode 2: interleaved */
#define DMADT_3         (3*0x1000u)  /* DMA transfer mode 3: interleaved */
#define DMADT_4         (4*0x1000u)  /* DMA transfer mode 4: single, repeat */
#define DMADT_5         (5*0x1000u)  /* DMA transfer mode 5: block, repeat */
#define DMADT_6         (6*0x1000u)  /* DMA transfer mode 6: interleaved, repeat */
#define DMADT_7         (7*0x1000u)  /* DMA transfer mode 7: interleaved, repeat */




/*-------------------------------------------------------------------------
 *   Brown-Out, Supply Voltage Supervision (SVS)
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char SVSCTL;  /*  SVS Control */

  struct
  {
    unsigned char SVSFG          : 1;  /* SVS Flag */
    unsigned char SVSOP          : 1;  /* SVS output (read only) */
    unsigned char SVSON          : 1;  /* Switches the SVS on/off */
    unsigned char PORON          : 1;  /* Enable POR Generation if Low Voltage */
    unsigned char VLD0           : 1;
    unsigned char VLD1           : 1;
    unsigned char VLD2           : 1;
    unsigned char VLD3           : 1;
  } SVSCTL_bit;
} @ 0x0055;


enum {
  SVSFG               = 0x0001,
  SVSOP               = 0x0002,
  SVSON               = 0x0004,
  PORON               = 0x0008,
  VLD0                = 0x0010,
  VLD1                = 0x0020,
  VLD2                = 0x0040,
  VLD3                = 0x0080,
};


#define __MSP430_HAS_SVS__            /* Definition to show that Module is available */

#define VLDON               (0x10)
#define VLDOFF              (0x00)
#define VLD_1_8V            (0x10)


/*-------------------------------------------------------------------------
 *   Flash Memory
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short FCTL1;  /* FLASH Control 1 */

  struct
  {
    unsigned short               : 1;
    unsigned short ERASE         : 1;  /* Enable bit for Flash segment erase */
    unsigned short MERAS         : 1;  /* Enable bit for Flash mass erase */
    unsigned short               : 3;
    unsigned short WRT           : 1;  /* Enable bit for Flash write */
    unsigned short BLKWRT        : 1;  /* Enable bit for Flash segment write */
    unsigned short KEY           : 8;  /* old definition */ /* Enable bit for Flash segment write */
  } FCTL1_bit;
} @ 0x0128;


enum {
  ERASE               = 0x0002,
  MERAS               = 0x0004,
  WRT                 = 0x0040,
  BLKWRT              = 0x0080,
};


__no_init volatile union
{
  unsigned short FCTL2;  /* FLASH Control 2 */

  struct
  {
    unsigned short FN0           : 1;  /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to: */
    unsigned short FN1           : 1;  /* 32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 */
    unsigned short FN2           : 1;
    unsigned short FN3           : 1;
    unsigned short FN4           : 1;
    unsigned short FN5           : 1;
    unsigned short SSEL0         : 1;  /* Flash clock select 0 */
    unsigned short SSEL1         : 1;  /* Flash clock select 1 */
    unsigned short KEY           : 8;
  } FCTL2_bit;
} @ 0x012A;


enum {
  FN0                 = 0x0001,
  FN1                 = 0x0002,
  FN2                 = 0x0004,
  FN3                 = 0x0008,
  FN4                 = 0x0010,
  FN5                 = 0x0020,
};


__no_init volatile union
{
  unsigned short FCTL3;  /* FLASH Control 3 */

  struct
  {
    unsigned short BUSY          : 1;  /* Flash busy: 1 */
    unsigned short KEYV          : 1;  /* Flash Key violation flag */
    unsigned short ACCVIFG       : 1;  /* Flash Access violation flag */
    unsigned short WAIT          : 1;  /* Wait flag for segment write */
    unsigned short LOCK          : 1;  /* Lock bit: 1 - Flash is locked (read only) */
    unsigned short EMEX          : 1;  /* Flash Emergency Exit */
    unsigned short KEY           : 8;
    unsigned short               : 2;
  } FCTL3_bit;
} @ 0x012C;


enum {
  BUSY                = 0x0001,
  KEYV                = 0x0002,
  ACCVIFG             = 0x0004,
  WAIT                = 0x0008,
  LOCK                = 0x0010,
  EMEX                = 0x0020,
  KEY                 = 0x2000,
};


#define __MSP430_HAS_FLASH__         /* Definition to show that Module is available */

#define FRKEY            (0x9600)    /* Flash key returned by read */
#define FWKEY            (0xA500)    /* Flash key for write */
#define FXKEY            (0x3300)    /* for use with XOR instruction */

#define FSSEL_0          (0x0000)    /* Flash clock select: 0 - ACLK */
#define FSSEL_1          (0x0040)    /* Flash clock select: 1 - MCLK */
#define FSSEL_2          (0x0080)    /* Flash clock select: 2 - SMCLK */
#define FSSEL_3          (0x00C0)    /* Flash clock select: 3 - SMCLK */



#pragma language=default
#endif  /* __IAR_SYSTEMS_ICC__  */


/************************************************************
* Timer A interrupt vector value
************************************************************/

#define TAIV_CCIFG1         (2)       /* Capture/compare 1 */
#define TAIV_CCIFG2         (4)       /* Capture/compare 2 */
#define TAIV_CCIFG3         (6)       /* Capture/compare 3 */
#define TAIV_CCIFG4         (8)       /* Capture/compare 4 */
#define TAIV_TAIFG          (10)      /* Timer overflow */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define DACDMA_VECTOR       (0 * 2u)  /* 0xFFE0 DAC/DMA */
#define PORT2_VECTOR        (1 * 2u)  /* 0xFFE2 Port 2 */
#define USART1TX_VECTOR     (2 * 2u)  /* 0xFFE4 USART 1 Transmit */
#define USART1RX_VECTOR     (3 * 2u)  /* 0xFFE6 USART 1 Receive */
#define PORT1_VECTOR        (4 * 2u)  /* 0xFFE8 Port 1 */
#define TIMERA1_VECTOR      (5 * 2u)  /* 0xFFEA Timer A CC1-2, TA */
#define TIMERA0_VECTOR      (6 * 2u)  /* 0xFFEC Timer A CC0 */
#define ADC12_VECTOR        (7 * 2u)  /* 0xFFEE ADC */
#define USART0TX_VECTOR     (8 * 2u)  /* 0xFFF0 USART 0 Transmit */
#define USART0RX_VECTOR     (9 * 2u)  /* 0xFFF2 USART 0 Receive */
#define WDT_VECTOR          (10 * 2u) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (11 * 2u) /* 0xFFF6 Comparator A */
#define TIMERB1_VECTOR      (12 * 2u) /* 0xFFF8 Timer B CC1-6, TB */
#define TIMERB0_VECTOR      (13 * 2u) /* 0xFFFA Timer B CC0 */
#define NMI_VECTOR          (14 * 2u) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (15 * 2u) /* 0xFFFE Reset [Highest Priority] */

#define UART1TX_VECTOR      USART1TX_VECTOR
#define UART1RX_VECTOR      USART1RX_VECTOR
#define UART0TX_VECTOR      USART0TX_VECTOR
#define UART0RX_VECTOR      USART0RX_VECTOR
#define ADC_VECTOR          ADC12_VECTOR


#endif /* __IO430xxxx */


